# BuiltInFailures.TilePatternTileFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TilePatternTileFailures Class
BuiltInFailures Class Members See Also
---
Failures related to tile pattern tile.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class TilePatternTileFailures
```

Visual Basic
---
```text
Public NotInheritable Class TilePatternTileFailures
```

Visual C++
---
```text
public ref class TilePatternTileFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..TilePatternTileFailures
# See Also
BuiltInFailures..::..TilePatternTileFailures Members
Autodesk.Revit.DB Namespace